Revit 2022 API
HVACLoadSpaceType.Create Method
 Creates a space type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2018
Syntax
C#
public static HVACLoadSpaceType Create(
	Document document,
	string name
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	name As String _
) As HVACLoadSpaceType
Visual C++
public:
static HVACLoadSpaceType^ Create(
	Document^ document,
	String^ name
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
name
Type: System.String
 The space type name.
Return Value
 The new space type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  name is an empty string or contains only whitespace. -or- name cannot include prohibited characters. -or- The given value for name is already in use as a space type name.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
HVACLoadSpaceType Class
Autodesk.Revit.DB.Analysis Namespace